[skipped] ./huaweicloud/services/acceptance/cce/common_test.go does not exist

``` 
run acceptance tests of huaweicloud/services/acceptance/cce/resource_huaweicloud_cce_node_test.go:
=== RUN   TestAccNode_basic
=== PAUSE TestAccNode_basic
=== RUN   TestAccNode_eip
=== PAUSE TestAccNode_eip
=== RUN   TestAccNode_volume_encryption
=== PAUSE TestAccNode_volume_encryption
=== RUN   TestAccNode_prePaid
=== PAUSE TestAccNode_prePaid
=== RUN   TestAccNode_password
=== PAUSE TestAccNode_password
=== RUN   TestAccNode_storage
=== PAUSE TestAccNode_storage
=== CONT  TestAccNode_basic
=== CONT  TestAccNode_prePaid
    acceptance.go:458: This environment does not support prepaid tests
--- SKIP: TestAccNode_prePaid (0.00s)
=== CONT  TestAccNode_storage
=== CONT  TestAccNode_volume_encryption
    acceptance.go:640: This environment does not support KMS tests
--- SKIP: TestAccNode_volume_encryption (0.00s)
=== CONT  TestAccNode_eip
=== CONT  TestAccNode_password
--- PASS: TestAccNode_storage (947.99s)
--- PASS: TestAccNode_basic (1048.27s)
--- PASS: TestAccNode_password (1447.84s)
--- PASS: TestAccNode_eip (2490.60s)
PASS
coverage: 25.8% of statements in ./huaweicloud/services/cce
ok  	github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/acceptance/cce	2490.641s	coverage: 25.8% of statements in ./huaweicloud/services/cce
```

``` 
run acceptance tests of huaweicloud/services/acceptance/cce/resource_huaweicloud_cce_node_attach_test.go:
=== RUN   TestAccNodeAttach_basic
=== PAUSE TestAccNodeAttach_basic
=== RUN   TestAccNodeAttach_prePaid
=== PAUSE TestAccNodeAttach_prePaid
=== CONT  TestAccNodeAttach_basic
=== CONT  TestAccNodeAttach_prePaid
    acceptance.go:458: This environment does not support prepaid tests
--- SKIP: TestAccNodeAttach_prePaid (0.00s)
--- PASS: TestAccNodeAttach_basic (1682.91s)
PASS
coverage: 21.3% of statements in ./huaweicloud/services/cce
ok  	github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/acceptance/cce	1682.949s	coverage: 21.3% of statements in ./huaweicloud/services/cce
```

``` 
run acceptance tests of huaweicloud/services/acceptance/cce/resource_huaweicloud_cce_node_pool_test.go:
=== RUN   TestAccNodePool_basic
=== PAUSE TestAccNodePool_basic
=== RUN   TestAccNodePool_tagsLabelsTaints
=== PAUSE TestAccNodePool_tagsLabelsTaints
=== RUN   TestAccNodePool_volume_encryption
=== PAUSE TestAccNodePool_volume_encryption
=== RUN   TestAccNodePool_prePaid
=== PAUSE TestAccNodePool_prePaid
=== RUN   TestAccNodePool_SecurityGroups
=== PAUSE TestAccNodePool_SecurityGroups
=== RUN   TestAccNodePool_serverGroup
=== PAUSE TestAccNodePool_serverGroup
=== RUN   TestAccNodePool_storage
=== PAUSE TestAccNodePool_storage
=== CONT  TestAccNodePool_basic
=== CONT  TestAccNodePool_storage
=== CONT  TestAccNodePool_serverGroup
=== CONT  TestAccNodePool_prePaid
    acceptance.go:458: This environment does not support prepaid tests
--- SKIP: TestAccNodePool_prePaid (0.00s)
=== CONT  TestAccNodePool_SecurityGroups
    resource_huaweicloud_cce_node_pool_test.go:583: Step 1/1 error: Error running apply: exit status 1
        
        Error: error creating CCE node pool: Bad request with: [POST https://cce.cn-north-4.myhuaweicloud.com/api/v3/projects/0970dd7a1300f5672ff2c003c60ae115/clusters/4b45ad4d-47d2-11ee-9db5-0255ac100265/nodepools], request_id: 0abeb4202d24e968c8aa665a10e9216a, error message: {"kind":"Status","apiVersion":"v1","metadata":{},"status":"Failure","code":400,"errorCode":"CCE.01400001","errorMessage":"Invalid request.","error_code":"CCE_CM.0004","error_msg":"Request is invalid","message":"Check nodepool flavor error: Flavor [s6.large.2] 's subeni quota is 0, Eni network is not supported ","reason":"BadRequest"}
        
          with huaweicloud_cce_node_pool.test,
          on terraform_plugin_test.tf line 117, in resource "huaweicloud_cce_node_pool" "test":
         117: resource "huaweicloud_cce_node_pool" "test" {
        
=== NAME  TestAccNodePool_basic
    resource_huaweicloud_cce_node_pool_test.go:42: Step 1/4 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # huaweicloud_cce_node_pool.test must be replaced
        -/+ resource "huaweicloud_cce_node_pool" "test" {
              ~ billing_mode             = 0 -> (known after apply)
              + charging_mode            = (known after apply)
              ~ current_node_count       = 1 -> (known after apply)
              ~ id                       = "1dbf5908-47d3-11ee-9c86-0255ac10024b" -> (known after apply)
              ~ initialized_conditions   = [] -> (known after apply)
              + max_pods                 = (known after apply)
                name                     = "tf-test-7igys"
              ~ os                       = "EulerOS 2.9" -> "EulerOS 2.5" # forces replacement
              ~ region                   = "cn-north-4" -> (known after apply)
              + runtime                  = (known after apply)
              ~ security_groups          = [] -> (known after apply)
              + status                   = (known after apply)
                # (11 unchanged attributes hidden)
        
              ~ data_volumes {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
        
              ~ extend_params {
                  - kube_reserved_mem   = 0 -> null
                  - max_pods            = 0 -> null
                  ~ postinstall         = <<-EOT
                      - #! /bin/bash
                      - date
                      + 9ed9fbab27be4ee55da4b90849c2ef86671ed999
                    EOT
                  - system_reserved_mem = 0 -> null
                    # (1 unchanged attribute hidden)
                }
        
              ~ root_volume {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
=== NAME  TestAccNodePool_serverGroup
    resource_huaweicloud_cce_node_pool_test.go:736: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # huaweicloud_cce_node_pool.test must be replaced
        -/+ resource "huaweicloud_cce_node_pool" "test" {
              ~ billing_mode             = 0 -> (known after apply)
              + charging_mode            = (known after apply)
              ~ current_node_count       = 1 -> (known after apply)
              ~ id                       = "339d81a5-47d3-11ee-9db5-0255ac100265" -> (known after apply)
              ~ initialized_conditions   = [] -> (known after apply)
              + max_pods                 = (known after apply)
                name                     = "tf-test-erihi"
              ~ os                       = "EulerOS 2.9" -> "EulerOS 2.5" # forces replacement
              ~ region                   = "cn-north-4" -> (known after apply)
              + runtime                  = (known after apply)
              ~ security_groups          = [] -> (known after apply)
              + status                   = (known after apply)
                # (12 unchanged attributes hidden)
        
              ~ data_volumes {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
        
              ~ root_volume {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
=== NAME  TestAccNodePool_storage
    resource_huaweicloud_cce_node_pool_test.go:807: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # huaweicloud_cce_node_pool.test must be replaced
        -/+ resource "huaweicloud_cce_node_pool" "test" {
              ~ billing_mode             = 0 -> (known after apply)
              + charging_mode            = (known after apply)
              ~ current_node_count       = 1 -> (known after apply)
              ~ id                       = "5516ac86-47d3-11ee-9db5-0255ac100265" -> (known after apply)
              ~ initialized_conditions   = [] -> (known after apply)
              + max_pods                 = (known after apply)
                name                     = "tf-test-kipej"
              ~ os                       = "EulerOS 2.9" -> "EulerOS 2.5" # forces replacement
              ~ region                   = "cn-north-4" -> (known after apply)
              + runtime                  = (known after apply)
              ~ security_groups          = [] -> (known after apply)
              + status                   = (known after apply)
                # (11 unchanged attributes hidden)
        
              ~ data_volumes {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                    # (3 unchanged attributes hidden)
                }
              ~ data_volumes {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                    # (3 unchanged attributes hidden)
                }
        
              ~ root_volume {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
        
              ~ storage {
                  ~ groups {
                      - cce_managed    = false -> null
                        name           = "vguser"
                        # (1 unchanged attribute hidden)
        
                        # (1 unchanged block hidden)
                    }
        
                    # (3 unchanged blocks hidden)
                }
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccNodePool_SecurityGroups (860.75s)
=== CONT  TestAccNodePool_tagsLabelsTaints
--- FAIL: TestAccNodePool_basic (1050.50s)
=== CONT  TestAccNodePool_volume_encryption
    acceptance.go:640: This environment does not support KMS tests
--- SKIP: TestAccNodePool_volume_encryption (0.00s)
--- FAIL: TestAccNodePool_storage (1265.48s)
--- FAIL: TestAccNodePool_serverGroup (1269.83s)
=== NAME  TestAccNodePool_tagsLabelsTaints
    resource_huaweicloud_cce_node_pool_test.go:286: Step 1/2 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # huaweicloud_cce_node_pool.test must be replaced
        -/+ resource "huaweicloud_cce_node_pool" "test" {
              ~ billing_mode             = 0 -> (known after apply)
              + charging_mode            = (known after apply)
              ~ current_node_count       = 1 -> (known after apply)
              ~ id                       = "320c4407-47d5-11ee-9db5-0255ac100265" -> (known after apply)
              ~ initialized_conditions   = [] -> (known after apply)
              + max_pods                 = (known after apply)
                name                     = "tf-test-ig410"
              ~ os                       = "EulerOS 2.9" -> "EulerOS 2.5" # forces replacement
              ~ region                   = "cn-north-4" -> (known after apply)
              + runtime                  = (known after apply)
              ~ security_groups          = [] -> (known after apply)
              + status                   = (known after apply)
                tags                     = {
                    "test1" = "val1"
                    "test2" = "val2"
                }
                # (12 unchanged attributes hidden)
        
              ~ data_volumes {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
        
              ~ root_volume {
                  + dss_pool_id    = (known after apply)
                  - hw_passthrough = false -> null
                  + kms_key_id     = (known after apply)
                    # (2 unchanged attributes hidden)
                }
        
                # (1 unchanged block hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccNodePool_tagsLabelsTaints (1615.74s)
FAIL
coverage: 23.5% of statements in ./huaweicloud/services/cce
FAIL	github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/acceptance/cce	2476.532s
FAIL
```

### coverage of files in huaweicloud/services:

- github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/cce/common.go (79.6%)
- github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/cce/resource_huaweicloud_cce_node.go (55.6%)
- github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/cce/resource_huaweicloud_cce_node_attach.go (76.4%)
- github.com/huaweicloud/terraform-provider-huaweicloud/huaweicloud/services/cce/resource_huaweicloud_cce_node_pool.go (62.1%)

### [summary] 1 failed in 3 resource acceptance tests